<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"91048307a3bedd889fc51bfce3742e137225ca8676d47edd1b44aeb9a2d67acd","plan_job_ref":"Job Terraform Plan #396 at https://github.com/cal-itp/data-infra/actions/runs/16210454621","plan_out_hash":"55c08a35a5ee8cd812fe88428cd0817349f7a866a0dfe1fb2e47ba3b815c5d10","plan_hash":"762f461e6f376db1c2596b3b478d73bd7b06d254c85afec682141e9fbb857c4b","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/gcs/us__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_storage_bucket.calitp-staging["calitp-staging-kuba-raw"] will be created
+   resource "google_storage_bucket" "calitp-staging" {
+       default_event_based_hold    = false
+       effective_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       force_destroy               = true
+       id                          = (known after apply)
+       location                    = "US-WEST2"
+       name                        = "calitp-staging-kuba-raw"
+       project                     = "cal-itp-data-infra-staging"
+       project_number              = (known after apply)
+       public_access_prevention    = "inherited"
+       requester_pays              = false
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       time_created                = (known after apply)
+       uniform_bucket_level_access = true
+       updated                     = (known after apply)
+       url                         = (known after apply)

+       lifecycle_rule {
+           action {
+               type          = "Delete"
#                (1 unchanged attribute hidden)
            }
+           condition {
+               age                        = 90
+               days_since_custom_time     = 0
+               days_since_noncurrent_time = 0
+               matches_prefix             = []
+               matches_storage_class      = []
+               matches_suffix             = []
+               num_newer_versions         = 0
+               with_state                 = "ANY"
#                (3 unchanged attributes hidden)
            }
        }

+       soft_delete_policy (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # google_storage_bucket_iam_binding.calitp-staging["calitp-staging-kuba-raw"] will be created
+   resource "google_storage_bucket_iam_binding" "calitp-staging" {
+       bucket  = "calitp-staging-kuba-raw"
+       etag    = (known after apply)
+       id      = (known after apply)
+       members = [
+           "projectEditor:cal-itp-data-infra-staging",
+           "projectOwner:cal-itp-data-infra-staging",
        ]
+       role    = "roles/storage.legacyObjectOwner"
    }

  # google_storage_bucket_iam_member.calitp-staging["calitp-staging-kuba-raw"] will be created
+   resource "google_storage_bucket_iam_member" "calitp-staging" {
+       bucket = "calitp-staging-kuba-raw"
+       etag   = (known after apply)
+       id     = (known after apply)
+       member = "projectViewer:cal-itp-data-infra-staging"
+       role   = "roles/storage.legacyBucketReader"
    }

  # google_storage_bucket_iam_policy.calitp-staging["calitp-staging-kuba-raw"] will be created
+   resource "google_storage_bucket_iam_policy" "calitp-staging" {
+       bucket      = "calitp-staging-kuba-raw"
+       etag        = (known after apply)
+       id          = (known after apply)
+       policy_data = jsonencode(
            {
+               bindings = [
+                   {
+                       members = [
+                           "projectEditor:cal-itp-data-infra-staging",
+                           "projectOwner:cal-itp-data-infra-staging",
                        ]
+                       role    = "roles/storage.legacyBucketOwner"
                    },
+                   {
+                       members = [
+                           "projectViewer:cal-itp-data-infra-staging",
                        ]
+                       role    = "roles/storage.legacyBucketReader"
                    },
+                   {
+                       members = [
+                           "projectEditor:cal-itp-data-infra-staging",
+                           "projectOwner:cal-itp-data-infra-staging",
                        ]
+                       role    = "roles/storage.legacyObjectOwner"
                    },
+                   {
+                       members = [
+                           "projectViewer:cal-itp-data-infra-staging",
                        ]
+                       role    = "roles/storage.legacyObjectReader"
                    },
                ]
            }
        )
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #396](https://github.com/cal-itp/data-infra/actions/runs/16210454621)